book_profile = {
"title": "Основи програмування",
"author": "Іван Петренко",
"year": 2023,
"publisher_info": {
"name": "Наукова думка",
"city": "Київ"
}
}

# 1. Отримайте назву книги та ім'я її автора.
# 2. Отримайте назву видавництва з вкладеного словника.
# 3. Напишіть код, який виводить інформацію у вигляді речення: Книга
# "[назва]" автора [автор] була видана у місті [місто].
# 4. Перевірте, чи є у словнику book_profile ключ "year". Якщо він є, виведіть
# його значення, якщо ні — повідомлення "Рік видання невідомий".
print(f'Назва книги: "{book_profile["title"]}", автор: {book_profile["author"]}')
print(f'Назва видавництва: "{book_profile["publisher_info"]["name"]}"')
print(f'Книга "{book_profile["title"]}" автора {book_profile["author"]} була видана у місті {book_profile["publisher_info"]["city"]}.')
print(f"Рік видання {book_profile.get('year', "невідомий")}")


# Автоматичний розрахунок «віку» книги та додавання категорії кожної книги
# за роком видання (наприклад, сучасне видання чи класика).
if 2026 - book_profile["year"] < 5:
    book_profile["book_age"] = "Сучасна література"
else:
    book_profile["book_age"] = "Класика"
print(book_profile["book_age"])